{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}E:\Projetos\EPGE_github\MicroEmpirica\\solutions\ex2\ex2_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Feb 2018, 23:56:02
{txt}
{com}. 
. /* EXERCÍCIO EMPÍRICO */
. use "${c -(}data{c )-}/pnad2015_ex2.dta", clear
{txt}
{com}. 
. * Define o Desenho Amostral
. svyset psu [pw = peso], strata(estrato)

      {txt}pweight:{col 16}{res}peso
          {txt}VCE:{col 16}{res}linearized
  {txt}Single unit:{col 16}{res}missing
     {txt}Strata 1:{col 16}{res}estrato
         {txt}SU 1:{col 16}{res}psu
        {txt}FPC 1:{col 16}<zero>
{p2colreset}{...}

{com}. 
. * Identifica os estratos com psu unico 
. quietly svydes, gen(single2)
{txt}
{com}. drop if single2==1
{txt}(31 observations deleted)

{com}. 
. * (a) Regressão OLS - Retornos a educação
. svy, subpop(pia): reg log_renda anos_estudo i.mulher idade idade2
{txt}(running regress on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}Number of strata{col 20}= {res}      727{txt}{col 49}Number of obs{col 68}= {res}   155026
{txt}{col 1}Number of PSUs{col 20}= {res}     6332{txt}{col 49}Population size{col 68}={res}  89095792
{txt}{col 49}Subpop. no. of obs{col 68}={res}    145640
{txt}{col 49}Subpop. size{col 68}={res}  83533568
{txt}{col 49}Design df{col 68}= {res}     5605
{txt}{col 49}F({res}   4{txt},{res}   5602{txt}){col 68}= {res}  3740.12
{txt}{col 49}Prob > F{col 68}= {res}   0.0000
{txt}{col 49}R-squared{col 68}= {res}   0.3217

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}   log_renda{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}anos_estudo {c |}{col 14}{res}{space 2} .1124933{col 26}{space 2} .0011366{col 37}{space 1}   98.98{col 46}{space 3}0.000{col 54}{space 4} .1102652{col 67}{space 3} .1147214
{txt}{space 12} {c |}
{space 6}mulher {c |}
{space 8}Sim  {c |}{col 14}{res}{space 2}-.4300674{col 26}{space 2} .0047006{col 37}{space 1}  -91.49{col 46}{space 3}0.000{col 54}{space 4}-.4392825{col 67}{space 3}-.4208524
{txt}{space 7}idade {c |}{col 14}{res}{space 2} .0618363{col 26}{space 2} .0012146{col 37}{space 1}   50.91{col 46}{space 3}0.000{col 54}{space 4} .0594553{col 67}{space 3} .0642174
{txt}{space 6}idade2 {c |}{col 14}{res}{space 2}-.0005701{col 26}{space 2} .0000154{col 37}{space 1}  -37.03{col 46}{space 3}0.000{col 54}{space 4}-.0006003{col 67}{space 3}-.0005399
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.781163{col 26}{space 2} .0269078{col 37}{space 1}  177.69{col 46}{space 3}0.000{col 54}{space 4} 4.728414{col 67}{space 3} 4.833913
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. esttab using "${c -(}root{c )-}\solutions\ex2\tabela_1.tex", ///
>                 title("Equação de Mincer desconsiderando viés de seleção") ///
>                 booktabs ///
>                 replace
{res}{txt}(output written to {browse  `"E:\Projetos\EPGE_github\MicroEmpirica\solutions\ex2\tabela_1.tex"'})

{com}. 
. * (b) Regressão OLS - Retornos a educação
. svy, subpop(pia): probit ind_renda anos_estudo casal##mulher c.n_filhos##mulher
{txt}(running probit on estimation sample)
{res}
{txt}Survey: Probit regression

{col 1}Number of strata{col 20}= {res}      727{txt}{col 49}Number of obs{col 68}= {res}   162570
{txt}{col 1}Number of PSUs{col 20}= {res}     6332{txt}{col 49}Population size{col 68}={res}  93621833
{txt}{col 49}Subpop. no. of obs{col 68}={res}    153184
{txt}{col 49}Subpop. size{col 68}={res}  88059609
{txt}{col 49}Design df{col 68}= {res}     5605
{txt}{col 49}F({res}   6{txt},{res}   5600{txt}){col 68}= {res}   598.20
{txt}{col 49}Prob > F{col 68}= {res}   0.0000

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}  Linearized
{col 1}        ind_renda{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}anos_estudo {c |}{col 19}{res}{space 2} .1034691{col 31}{space 2} .0020605{col 42}{space 1}   50.22{col 51}{space 3}0.000{col 59}{space 4} .0994297{col 72}{space 3} .1075085
{txt}{space 10}1.casal {c |}{col 19}{res}{space 2}  .340997{col 31}{space 2} .0241652{col 42}{space 1}   14.11{col 51}{space 3}0.000{col 59}{space 4} .2936238{col 72}{space 3} .3883702
{txt}{space 17} {c |}
{space 11}mulher {c |}
{space 13}Sim  {c |}{col 19}{res}{space 2} .1994696{col 31}{space 2} .0280806{col 42}{space 1}    7.10{col 51}{space 3}0.000{col 59}{space 4} .1444208{col 72}{space 3} .2545184
{txt}{space 17} {c |}
{space 5}casal#mulher {c |}
{space 11}1#Sim  {c |}{col 19}{res}{space 2}-.9201015{col 31}{space 2} .0323819{col 42}{space 1}  -28.41{col 51}{space 3}0.000{col 59}{space 4}-.9835826{col 72}{space 3}-.8566205
{txt}{space 17} {c |}
{space 9}n_filhos {c |}{col 19}{res}{space 2} .0173418{col 31}{space 2} .0018048{col 42}{space 1}    9.61{col 51}{space 3}0.000{col 59}{space 4} .0138038{col 72}{space 3} .0208799
{txt}{space 17} {c |}
mulher#c.n_filhos {c |}
{space 13}Sim  {c |}{col 19}{res}{space 2} -.017808{col 31}{space 2} .0019817{col 42}{space 1}   -8.99{col 51}{space 3}0.000{col 59}{space 4}-.0216929{col 72}{space 3}-.0139232
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2} .7775304{col 31}{space 2} .0272929{col 42}{space 1}   28.49{col 51}{space 3}0.000{col 59}{space 4} .7240258{col 72}{space 3} .8310351
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. esttab using "${c -(}root{c )-}\solutions\ex2\tabela_2.tex", ///
>                 title("Equação de seleçao - Modelo Probit") ///
>                 booktabs ///
>                 replace
{res}{txt}(output written to {browse  `"E:\Projetos\EPGE_github\MicroEmpirica\solutions\ex2\tabela_2.tex"'})

{com}. 
. * (c) Heckman Correction
. svy, subpop(pia): heckman log_renda anos_estudo i.mulher idade idade2, select(ind_renda = anos_estudo casal##mulher c.n_filhos##mulher)
{txt}(running heckman on estimation sample)
{res}
{txt}Survey: Heckman selection model
(regression model with sample selection)

{col 1}Number of strata{col 20}= {res}      727{txt}{col 49}Number of obs{col 68}= {res}   162570
{txt}{col 1}Number of PSUs{col 20}= {res}     6332{txt}{col 49}Population size{col 68}={res}  93621833
{txt}{col 49}Subpop. no. of obs{col 68}={res}    153184
{txt}{col 49}Subpop. size{col 68}={res}  88059609
{txt}{col 49}Design df{col 68}= {res}     5605
{txt}{col 49}F({res}   4{txt},{res}   5602{txt}){col 68}= {res}  3728.19
{txt}{col 49}Prob > F{col 68}= {res}   0.0000

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}  Linearized
{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}log_renda         {txt}{c |}
{space 6}anos_estudo {c |}{col 19}{res}{space 2} .1123767{col 31}{space 2} .0011478{col 42}{space 1}   97.91{col 51}{space 3}0.000{col 59}{space 4} .1101266{col 72}{space 3} .1146268
{txt}{space 17} {c |}
{space 11}mulher {c |}
{space 13}Sim  {c |}{col 19}{res}{space 2}-.4294891{col 31}{space 2} .0046134{col 42}{space 1}  -93.10{col 51}{space 3}0.000{col 59}{space 4}-.4385331{col 72}{space 3}-.4204452
{txt}{space 12}idade {c |}{col 19}{res}{space 2} .0618409{col 31}{space 2} .0012148{col 42}{space 1}   50.91{col 51}{space 3}0.000{col 59}{space 4} .0594595{col 72}{space 3} .0642223
{txt}{space 11}idade2 {c |}{col 19}{res}{space 2}-.0005702{col 31}{space 2} .0000154{col 42}{space 1}  -37.02{col 51}{space 3}0.000{col 59}{space 4}-.0006004{col 72}{space 3}  -.00054
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}  4.78258{col 31}{space 2} .0269547{col 42}{space 1}  177.43{col 51}{space 3}0.000{col 59}{space 4} 4.729739{col 72}{space 3} 4.835422
{txt}{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ind_renda         {txt}{c |}
{space 6}anos_estudo {c |}{col 19}{res}{space 2} .1033689{col 31}{space 2} .0021151{col 42}{space 1}   48.87{col 51}{space 3}0.000{col 59}{space 4} .0992225{col 72}{space 3} .1075154
{txt}{space 10}1.casal {c |}{col 19}{res}{space 2} .3420813{col 31}{space 2} .0245656{col 42}{space 1}   13.93{col 51}{space 3}0.000{col 59}{space 4} .2939232{col 72}{space 3} .3902395
{txt}{space 17} {c |}
{space 11}mulher {c |}
{space 13}Sim  {c |}{col 19}{res}{space 2} .2004867{col 31}{space 2} .0282851{col 42}{space 1}    7.09{col 51}{space 3}0.000{col 59}{space 4}  .145037{col 72}{space 3} .2559364
{txt}{space 17} {c |}
{space 5}casal#mulher {c |}
{space 11}1#Sim  {c |}{col 19}{res}{space 2} -.921385{col 31}{space 2} .0327488{col 42}{space 1}  -28.13{col 51}{space 3}0.000{col 59}{space 4}-.9855853{col 72}{space 3}-.8571847
{txt}{space 17} {c |}
{space 9}n_filhos {c |}{col 19}{res}{space 2} .0173984{col 31}{space 2} .0018215{col 42}{space 1}    9.55{col 51}{space 3}0.000{col 59}{space 4} .0138276{col 72}{space 3} .0209692
{txt}{space 17} {c |}
mulher#c.n_filhos {c |}
{space 13}Sim  {c |}{col 19}{res}{space 2}-.0178471{col 31}{space 2} .0019835{col 42}{space 1}   -9.00{col 51}{space 3}0.000{col 59}{space 4}-.0217355{col 72}{space 3}-.0139588
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2} .7771245{col 31}{space 2} .0272721{col 42}{space 1}   28.50{col 51}{space 3}0.000{col 59}{space 4} .7236606{col 72}{space 3} .8305884
{txt}{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          /athrho {c |}{col 19}{res}{space 2}-.0093267{col 31}{space 2} .0153595{col 42}{space 1}   -0.61{col 51}{space 3}0.544{col 59}{space 4}-.0394374{col 72}{space 3} .0207839
{txt}         /lnsigma {c |}{col 19}{res}{space 2}-.3441287{col 31}{space 2}  .005473{col 42}{space 1}  -62.88{col 51}{space 3}0.000{col 59}{space 4}-.3548578{col 72}{space 3}-.3333995
{txt}{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              rho{col 19}{c |}{res}{space 2}-.0093265{col 31}{space 2} .0153582{col 59}{space 4}-.0394169{col 72}{space 3} .0207809
{col 1}{txt}            sigma{col 19}{c |}{res}{space 2} .7088377{col 31}{space 2} .0038794{col 59}{space 4} .7012732{col 72}{space 3} .7164839
{col 1}{txt}           lambda{col 19}{c |}{res}{space 2}-.0066109{col 31}{space 2} .0108892{col 59}{space 4}-.0279579{col 72}{space 3} .0147361
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. esttab using "${c -(}root{c )-}\solutions\ex2\tabela_3.tex", ///
>                 title("Equação de Mincer (com correção de Heckman)") ///
>                 booktabs ///
>                 nostar ///
>                 replace
{res}{txt}(output written to {browse  `"E:\Projetos\EPGE_github\MicroEmpirica\solutions\ex2\tabela_3.tex"'})

{com}.                 
. * (d) Two step Correction
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}E:\Projetos\EPGE_github\MicroEmpirica\\solutions\ex2\ex2_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Feb 2018, 23:58:24
{txt}{.-}
{smcl}
{txt}{sf}{ul off}